Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotPasteNoLevelAbove Property
 Can't paste these elements at this height because there is no Level above to Reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotPasteNoLevelAbove { get; }
Visual Basic
Public Shared ReadOnly Property CannotPasteNoLevelAbove As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotPasteNoLevelAbove {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace